
//1. Створити порожній проект в IntelliJ
//! СТВОРЕНО ОКРЕМО

//        2. Створити клас "Співробітник" з полями: ПІБ, посада, email, телефон, вік.
//        3. Конструктор класу повинен заповнювати ці поля під час створення об'єкта.
//        Забезпечити інкапсуляцію внутрішніх властивостей класу.
//        4. Створити два класи з однаковим ім'ям SameName. (Використовувати пакети)
//        5. Створити клас Car з публічним методом start.
//        Метод start викликає у собі методи:
//        - startElectricity()
//        - startCommand()
//        - startFuelSystem()
//        Перелічені методи, є внутрішньою (прихованою)
//        частиною комплексного методу start. Вони по суті відображають
//        внутрішню поведінку класу Car і не повинні використовуватися
//        за межами даного класу.
public class Main {
    public static void main(String[] args) {
        Employee ddd=new Employee("dssdf","asda",
                "dwfew","qdqweqe","csdsdc@sdd",
                "234234242342",123135);
        Car sss=new Car();

        ddd.printEmployee();
        System.out.println();
        sss.start();

    }
}